---
kind: property
id: P:Autodesk.Revit.DB.Architecture.ContinuousRailType.StartOrBottomExtensionLength
source: html/1f0b1969-ba60-f02b-d45e-59919c14e8ce.htm
---
# Autodesk.Revit.DB.Architecture.ContinuousRailType.StartOrBottomExtensionLength Property

The extension length of the rail termination at the beginning or bottom.

## Syntax (C#)
```csharp
public double StartOrBottomExtensionLength { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for startExtensionLength must be between 0 and 30000 feet.